program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}})]
{
    func main<ios16>(tensor<fp32, [1, 20, 224, 224, 3]> input_1) {
            tensor<int32, []> model_bidirectional_forward_lstm_PartitionedCall_time = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_time"), val = tensor<int32, []>(0)];
            tensor<int32, []> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_num_elements = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_num_elements"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_Reshape_shape = const()[name = tensor<string, []>("model_time_distributed_Reshape_shape"), val = tensor<int32, [4]>([-1, 224, 224, 3])];
            tensor<int32, [3]> model_time_distributed_1_Reshape_1_shape = const()[name = tensor<string, []>("model_time_distributed_1_Reshape_1_shape"), val = tensor<int32, [3]>([-1, 20, 576])];
            tensor<int32, [3]> model_bidirectional_forward_lstm_PartitionedCall_transpose_perm = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_transpose_perm"), val = tensor<int32, [3]>([1, 0, 2])];
            tensor<int32, []> model_bidirectional_backward_lstm_PartitionedCall_time = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_time"), val = tensor<int32, []>(0)];
            tensor<int32, []> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_num_elements = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_num_elements"), val = tensor<int32, []>(1)];
            tensor<int32, [1]> model_bidirectional_backward_lstm_PartitionedCall_ReverseV2_axis = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_ReverseV2_axis"), val = tensor<int32, [1]>([0])];
            tensor<int32, []> model_bidirectional_concat_axis = const()[name = tensor<string, []>("model_bidirectional_concat_axis"), val = tensor<int32, []>(1)];
            tensor<string, []> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0 = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<bool, []> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0 = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0 = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0 = const()[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0"), val = tensor<int32, []>(64)];
            list<tensor<fp32, [1, 64]>, 1> model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1 = make_list(dtype = model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0, dynamic_length = model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0, elem_shape = (model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0, model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0), init_length = model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1_num_elements)[name = tensor<string, []>("model_bidirectional_forward_lstm_PartitionedCall_TensorArrayV2_1")];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 20, 224, 224, 3]> cast_53 = cast(dtype = input_1_to_fp16_dtype_0, x = input_1)[name = tensor<string, []>("cast_15")];
            tensor<fp16, [20, 224, 224, 3]> model_time_distributed_Reshape_cast_fp16 = reshape(shape = model_time_distributed_Reshape_shape, x = cast_53)[name = tensor<string, []>("model_time_distributed_Reshape_cast_fp16")];
            tensor<string, []> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0 = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<bool, []> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0 = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0 = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0"), val = tensor<int32, []>(1)];
            tensor<int32, []> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0 = const()[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0"), val = tensor<int32, []>(64)];
            list<tensor<fp32, [1, 64]>, 1> model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1 = make_list(dtype = model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dtype_0, dynamic_length = model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_dynamic_length_0, elem_shape = (model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape0_0, model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_elem_shape1_0), init_length = model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1_num_elements)[name = tensor<string, []>("model_bidirectional_backward_lstm_PartitionedCall_TensorArrayV2_1")];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_rescaling_Cast_x_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_rescaling_Cast_x_to_fp16"), val = tensor<fp16, []>(0x1.01p-7)];
            tensor<fp16, [20, 224, 224, 3]> model_time_distributed_MobilenetV3small_rescaling_mul_cast_fp16 = mul(x = model_time_distributed_Reshape_cast_fp16, y = model_time_distributed_MobilenetV3small_rescaling_Cast_x_to_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_rescaling_mul_cast_fp16")];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_rescaling_Cast_1_x_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_rescaling_Cast_1_x_to_fp16"), val = tensor<fp16, []>(-0x1p+0)];
            tensor<fp16, [20, 224, 224, 3]> model_time_distributed_MobilenetV3small_rescaling_add_cast_fp16 = add(x = model_time_distributed_MobilenetV3small_rescaling_mul_cast_fp16, y = model_time_distributed_MobilenetV3small_rescaling_Cast_1_x_to_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_rescaling_add_cast_fp16")];
            tensor<int32, [4]> transpose_1_perm_0 = const()[name = tensor<string, []>("transpose_1_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 3, 3, 3]> const_4 = const()[name = tensor<string, []>("const_4"), val = tensor<fp16, [16, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [16]> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024)))];
            tensor<fp16, [20, 3, 224, 224]> transpose_280 = transpose(perm = transpose_1_perm_0, x = model_time_distributed_MobilenetV3small_rescaling_add_cast_fp16)[name = tensor<string, []>("transpose_102")];
            tensor<fp16, [20, 16, 112, 112]> model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_5, dilations = model_time_distributed_MobilenetV3small_Conv_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_Conv_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_Conv_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_Conv_Conv2Dx_strides_0, weight = const_4, x = transpose_280)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_tf_math_add_Add_y_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_add_Add_y_to_fp16"), val = tensor<fp16, []>(0x1.8p+1)];
            tensor<fp16, [20, 112, 112, 16]> transpose_279 = transpose(perm = model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_Conv_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_101")];
            tensor<fp16, [20, 112, 112, 16]> model_time_distributed_MobilenetV3small_tf_math_add_Add_cast_fp16 = add(x = transpose_279, y = model_time_distributed_MobilenetV3small_tf_math_add_Add_y_to_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_add_Add_cast_fp16")];
            tensor<fp16, [20, 112, 112, 16]> model_time_distributed_MobilenetV3small_re_lu_Relu6_cast_fp16 = relu6(x = model_time_distributed_MobilenetV3small_tf_math_add_Add_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_Relu6_cast_fp16")];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [20, 112, 112, 16]> model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_cast_fp16 = mul(x = model_time_distributed_MobilenetV3small_re_lu_Relu6_cast_fp16, y = model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_y_to_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_cast_fp16")];
            tensor<fp16, [20, 112, 112, 16]> model_time_distributed_MobilenetV3small_multiply_mul_cast_fp16 = mul(x = transpose_279, y = model_time_distributed_MobilenetV3small_tf_math_multiply_Mul_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_multiply_mul_cast_fp16")];
            tensor<string, []> pad_0_mode_0 = const()[name = tensor<string, []>("pad_0_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [4]> transpose_139_perm_0 = const()[name = tensor<string, []>("transpose_139_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [8]> pad_4_pad_0 = const()[name = tensor<string, []>("pad_4_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [20, 16, 112, 112]> transpose_278 = transpose(perm = transpose_139_perm_0, x = model_time_distributed_MobilenetV3small_multiply_mul_cast_fp16)[name = tensor<string, []>("transpose_100")];
            tensor<fp16, [20, 16, 113, 113]> pad_4_cast_fp16 = pad(constant_val = const_0_to_fp16, mode = pad_0_mode_0, pad = pad_4_pad_0, x = transpose_278)[name = tensor<string, []>("pad_4_cast_fp16")];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(16)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 1, 3, 3]> const_6 = const()[name = tensor<string, []>("const_6"), val = tensor<fp16, [16, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1152)))];
            tensor<fp16, [16]> const_7 = const()[name = tensor<string, []>("const_7"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1536)))];
            tensor<fp16, [20, 16, 56, 56]> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_7, dilations = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_depthwisex_strides_0, weight = const_6, x = pad_4_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 56, 56, 16]> transpose_277 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_99")];
            tensor<fp16, [20, 56, 56, 16]> model_time_distributed_MobilenetV3small_re_lu_1_Relu_cast_fp16 = relu(x = transpose_277)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_1_Relu_cast_fp16")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_axes_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_axes_0"), val = tensor<int32, [2]>([1, 2])];
            tensor<bool, []> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_keep_dims_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [20, 1, 1, 16]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_cast_fp16 = reduce_mean(axes = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_axes_0, keep_dims = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_keep_dims_0, x = model_time_distributed_MobilenetV3small_re_lu_1_Relu_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_cast_fp16")];
            tensor<int32, [4]> transpose_7_perm_0 = const()[name = tensor<string, []>("transpose_7_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [8, 16, 1, 1]> conv_0_weight_0_to_fp16 = const()[name = tensor<string, []>("conv_0_weight_0_to_fp16"), val = tensor<fp16, [8, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1664)))];
            tensor<fp16, [8]> conv_0_bias_0_to_fp16 = const()[name = tensor<string, []>("conv_0_bias_0_to_fp16"), val = tensor<fp16, [8]>([0x1.53p-1, -0x1.618p+0, 0x1.e78p-3, 0x1.7bp+1, -0x1.7e8p+0, -0x1.1f4p+1, 0x1.59cp+1, 0x1.91cp+0])];
            tensor<fp16, [20, 16, 1, 1]> transpose_276 = transpose(perm = transpose_7_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_AvgPool_Mean_cast_fp16)[name = tensor<string, []>("transpose_98")];
            tensor<fp16, [20, 8, 1, 1]> conv_0_cast_fp16 = conv(bias = conv_0_bias_0_to_fp16, dilations = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2Dx_strides_0, weight = conv_0_weight_0_to_fp16, x = transpose_276)[name = tensor<string, []>("conv_0_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2D_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2D_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 1, 1, 8]> transpose_275 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_Conv2D_perm_0, x = conv_0_cast_fp16)[name = tensor<string, []>("transpose_97")];
            tensor<fp16, [20, 1, 1, 8]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Relu_Relu_cast_fp16 = relu(x = transpose_275)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Relu_Relu_cast_fp16")];
            tensor<int32, [4]> transpose_9_perm_0 = const()[name = tensor<string, []>("transpose_9_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 8, 1, 1]> conv_18_weight_0_to_fp16 = const()[name = tensor<string, []>("conv_18_weight_0_to_fp16"), val = tensor<fp16, [16, 8, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1984)))];
            tensor<fp16, [16]> conv_18_bias_0_to_fp16 = const()[name = tensor<string, []>("conv_18_bias_0_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2304)))];
            tensor<fp16, [20, 8, 1, 1]> transpose_274 = transpose(perm = transpose_9_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Relu_Relu_cast_fp16)[name = tensor<string, []>("transpose_96")];
            tensor<fp16, [20, 16, 1, 1]> conv_18_cast_fp16 = conv(bias = conv_18_bias_0_to_fp16, dilations = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2Dx_strides_0, weight = conv_18_weight_0_to_fp16, x = transpose_274)[name = tensor<string, []>("conv_18_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2D_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2D_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 1, 1, 16]> transpose_273 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Conv_1_Conv2D_perm_0, x = conv_18_cast_fp16)[name = tensor<string, []>("transpose_95")];
            tensor<fp16, [20, 1, 1, 16]> model_time_distributed_MobilenetV3small_re_lu_2_Relu6_cast_fp16 = relu6(x = transpose_273)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_2_Relu6_cast_fp16")];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_y_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_y_to_fp16"), val = tensor<fp16, []>(0x1.554p-3)];
            tensor<fp16, [20, 1, 1, 16]> model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_cast_fp16 = mul(x = model_time_distributed_MobilenetV3small_re_lu_2_Relu6_cast_fp16, y = model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_y_to_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_cast_fp16")];
            tensor<fp16, [20, 56, 56, 16]> model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Mul_mul_cast_fp16 = mul(x = model_time_distributed_MobilenetV3small_re_lu_1_Relu_cast_fp16, y = model_time_distributed_MobilenetV3small_tf_math_multiply_1_Mul_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Mul_mul_cast_fp16")];
            tensor<int32, [4]> transpose_11_perm_0 = const()[name = tensor<string, []>("transpose_11_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 16, 1, 1]> const_8 = const()[name = tensor<string, []>("const_8"), val = tensor<fp16, [16, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2432)))];
            tensor<fp16, [16]> const_9 = const()[name = tensor<string, []>("const_9"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3008)))];
            tensor<fp16, [20, 16, 56, 56]> transpose_272 = transpose(perm = transpose_11_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_squeeze_excite_Mul_mul_cast_fp16)[name = tensor<string, []>("transpose_94")];
            tensor<fp16, [20, 16, 56, 56]> model_time_distributed_MobilenetV3small_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_9, dilations = model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_project_Conv2Dx_strides_0, weight = const_8, x = transpose_272)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 16, 1, 1]> const_10 = const()[name = tensor<string, []>("const_10"), val = tensor<fp16, [72, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3136)))];
            tensor<fp16, [72]> const_11 = const()[name = tensor<string, []>("const_11"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5504)))];
            tensor<fp16, [20, 72, 56, 56]> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_11, dilations = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_Conv2Dx_strides_0, weight = const_10, x = model_time_distributed_MobilenetV3small_expanded_conv_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 56, 56, 72]> transpose_271 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_1_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_93")];
            tensor<fp16, [20, 56, 56, 72]> model_time_distributed_MobilenetV3small_re_lu_3_Relu_cast_fp16 = relu(x = transpose_271)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_3_Relu_cast_fp16")];
            tensor<string, []> pad_1_mode_0 = const()[name = tensor<string, []>("pad_1_mode_0"), val = tensor<string, []>("constant")];
            tensor<int32, [4]> transpose_140_perm_0 = const()[name = tensor<string, []>("transpose_140_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<int32, [8]> pad_5_pad_0 = const()[name = tensor<string, []>("pad_5_pad_0"), val = tensor<int32, [8]>([0, 0, 0, 0, 0, 1, 0, 1])];
            tensor<fp16, []> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [20, 72, 56, 56]> transpose_270 = transpose(perm = transpose_140_perm_0, x = model_time_distributed_MobilenetV3small_re_lu_3_Relu_cast_fp16)[name = tensor<string, []>("transpose_92")];
            tensor<fp16, [20, 72, 57, 57]> pad_5_cast_fp16 = pad(constant_val = const_1_to_fp16, mode = pad_1_mode_0, pad = pad_5_pad_0, x = transpose_270)[name = tensor<string, []>("pad_5_cast_fp16")];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(72)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [72, 1, 3, 3]> const_12 = const()[name = tensor<string, []>("const_12"), val = tensor<fp16, [72, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5760)))];
            tensor<fp16, [72]> const_13 = const()[name = tensor<string, []>("const_13"), val = tensor<fp16, [72]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7168)))];
            tensor<fp16, [20, 72, 28, 28]> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_13, dilations = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_depthwisex_strides_0, weight = const_12, x = pad_5_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 28, 28, 72]> transpose_269 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_1_depthwise_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_91")];
            tensor<fp16, [20, 28, 28, 72]> model_time_distributed_MobilenetV3small_re_lu_4_Relu_cast_fp16 = relu(x = transpose_269)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_4_Relu_cast_fp16")];
            tensor<int32, [4]> transpose_20_perm_0 = const()[name = tensor<string, []>("transpose_20_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [24, 72, 1, 1]> const_14 = const()[name = tensor<string, []>("const_14"), val = tensor<fp16, [24, 72, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7424)))];
            tensor<fp16, [24]> const_15 = const()[name = tensor<string, []>("const_15"), val = tensor<fp16, [24]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(10944)))];
            tensor<fp16, [20, 72, 28, 28]> transpose_268 = transpose(perm = transpose_20_perm_0, x = model_time_distributed_MobilenetV3small_re_lu_4_Relu_cast_fp16)[name = tensor<string, []>("transpose_90")];
            tensor<fp16, [20, 24, 28, 28]> model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = conv(bias = const_15, dilations = model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_1_project_Conv2Dx_strides_0, weight = const_14, x = transpose_268)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<int32, [4]> transpose_23_perm_0 = const()[name = tensor<string, []>("transpose_23_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [88, 24, 1, 1]> transpose_22_to_fp16_quantized = constexpr_affine_dequantize()[axis = tensor<int32, []>(0), name = tensor<string, []>("transpose_22_to_fp16_quantized"), quantized_data = tensor<int8, [88, 24, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(11072))), scale = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13440))), zero_point = tensor<int8, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13248)))];
            tensor<fp16, [20, 28, 28, 24]> transpose_267 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_1_project_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_89")];
            tensor<fp16, [20, 24, 28, 28]> transpose_266 = transpose(perm = transpose_23_perm_0, x = transpose_267)[name = tensor<string, []>("transpose_88")];
            tensor<fp16, [20, 88, 28, 28]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_cast_fp16 = conv(dilations = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_dilations_0, groups = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_groups_0, pad = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_0, pad_type = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_pad_type_0, strides = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_strides_0, weight = transpose_22_to_fp16_quantized, x = transpose_266)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_cast_fp16")];
            tensor<fp16, [88]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13696)))];
            tensor<fp16, [88]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_1_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_1_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13952)))];
            tensor<fp16, [88]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14208)))];
            tensor<fp16, [88]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_1_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_1_to_fp16"), val = tensor<fp16, [88]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14464)))];
            tensor<fp16, []> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_epsilon_0_to_fp16 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_epsilon_0_to_fp16"), val = tensor<fp16, []>(0x1.064p-10)];
            tensor<fp16, [20, 88, 28, 28]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16 = batch_norm(beta = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_1_to_fp16, epsilon = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_epsilon_0_to_fp16, gamma = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_ReadVariableOp_to_fp16, mean = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_to_fp16, variance = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_ReadVariableOp_1_to_fp16, x = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_Conv2Dx_cast_fp16)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16")];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [20, 28, 28, 88]> transpose_265 = transpose(perm = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_to_NHWC_perm_0, x = model_time_distributed_MobilenetV3small_expanded_conv_2_expand_BatchNorm_FusedBatchNormV3_nchw_cast_fp16)[name = tensor<string, []>("transpose_87")];
            tensor<fp16, [20, 28, 28, 88]> model_time_distributed_MobilenetV3small_re_lu_5_Relu_cast_fp16 = relu(x = transpose_265)[name = tensor<string, []>("model_time_distributed_MobilenetV3small_re_lu_5_Relu_cast_fp16")];
            tensor<int32, [4]> transpose_26_perm_0 = const()[name = tensor<string, []>("transpose_26_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_pad_type_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_strides_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_dilations_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_groups_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_groups_0"), val = tensor<int32, []>(88)];
            tensor<int32, [4]> model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_pad_0 = const()[name = tensor<string, []>("model_time_distributed_MobilenetV3small_expanded_conv_2_depthwise_depthwisex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [88, 1, 3, 3]> const_16 = const()[name = tensor<string, []>("const_16"), val = tensor<fp16, [88, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14720)))];
